### 📋 Infrastructure Change Review
This PR proposes the following infrastructure changes:

```hcl
[command]/home/runner/work/_temp/ff05fe13-e803-4c6e-88e8-5274ebc02ef8/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_group.auth must be replaced
-/+ resource "azurerm_container_group" "auth" {
      ~ exposed_port                = [
          - {
              - port     = 8000
              - protocol = "TCP"
            },
        ] -> (known after apply)
      + fqdn                        = (known after apply)
      ~ id                          = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.ContainerInstance/containerGroups/auth-service" -> (known after apply)
      ~ ip_address                  = "10.0.6.4" -> (known after apply)
        name                        = "auth-service"
      + network_profile_id          = (known after apply)
      - tags                        = {} -> null
      - zones                       = [] -> null
        # (8 unchanged attributes hidden)

      ~ container {
          ~ commands                     = [] -> (known after apply)
          - cpu_limit                    = 0 -> null
          ~ image                        = "osgomez/auth-api:gh-38e787e5" -> "osgomez/auth-service:latest" # forces replacement
          - memory_limit                 = 0 -> null
            name                         = "auth-container"
          - secure_environment_variables = (sensitive value) -> null
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_container_group.frontend must be replaced
-/+ resource "azurerm_container_group" "frontend" {
      ~ exposed_port                = [
          - {
              - port     = 80
              - protocol = "TCP"
            },
        ] -> (known after apply)
      ~ fqdn                        = "microservice-frontend-3kugvams.centralus.azurecontainer.io" -> (known after apply)
      ~ id                          = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.ContainerInstance/containerGroups/frontend-service" -> (known after apply)
      ~ ip_address                  = "48.214.173.102" -> (known after apply)
        name                        = "frontend-service"
      + network_profile_id          = (known after apply)
      - subnet_ids                  = [] -> null
      - tags                        = {} -> null
      - zones                       = [] -> null
        # (8 unchanged attributes hidden)

      ~ container {
          ~ commands                     = [] -> (known after apply)
          - cpu_limit                    = 0 -> null
          ~ environment_variables        = { # forces replacement
              - "AUTH_API_ADDRESS"  = "http://10.0.6.4:8000"
              - "TODOS_API_ADDRESS" = "http://10.0.8.4:8082"
            } -> (known after apply) # forces replacement
          ~ image                        = "osgomez/frontend:gh-38e787e5" -> "osgomez/frontend:latest" # forces replacement
          - memory_limit                 = 0 -> null
            name                         = "frontend-container"
          - secure_environment_variables = (sensitive value) -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_container_group.todos must be replaced
-/+ resource "azurerm_container_group" "todos" {
      ~ exposed_port                = [
          - {
              - port     = 8082
              - protocol = "TCP"
            },
        ] -> (known after apply)
      + fqdn                        = (known after apply)
      ~ id                          = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.ContainerInstance/containerGroups/todos-service" -> (known after apply)
      ~ ip_address                  = "10.0.8.4" -> (known after apply)
        name                        = "todos-service"
      + network_profile_id          = (known after apply)
      - tags                        = {} -> null
      - zones                       = [] -> null
        # (8 unchanged attributes hidden)

      ~ container {
          ~ commands                     = [] -> (known after apply)
          - cpu_limit                    = 0 -> null
          ~ image                        = "osgomez/todos-api:gh-38e787e5" -> "osgomez/todos-service:latest" # forces replacement
          - memory_limit                 = 0 -> null
            name                         = "todos-container"
          - secure_environment_variables = (sensitive value) -> null
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_container_group.users must be replaced
-/+ resource "azurerm_container_group" "users" {
      ~ exposed_port                = [
          - {
              - port     = 8083
              - protocol = "TCP"
            },
        ] -> (known after apply)
      + fqdn                        = (known after apply)
      ~ id                          = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.ContainerInstance/containerGroups/users-service" -> (known after apply)
      ~ ip_address                  = "10.0.7.4" -> (known after apply)
        name                        = "users-service"
      + network_profile_id          = (known after apply)
      - tags                        = {} -> null
      - zones                       = [] -> null
        # (8 unchanged attributes hidden)

      ~ container {
          ~ commands                     = [] -> (known after apply)
          - cpu_limit                    = 0 -> null
          ~ image                        = "osgomez/users-api:gh-38e787e5" -> "osgomez/users-service:latest" # forces replacement
          - memory_limit                 = 0 -> null
            name                         = "users-container"
          - secure_environment_variables = (sensitive value) -> null
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.security.azurerm_private_dns_a_record.redis will be created
  + resource "azurerm_private_dns_a_record" "redis" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "microservice-redis"
      + records             = (known after apply)
      + resource_group_name = "microservice-app-rg"
      + ttl                 = 300
      + zone_name           = "privatelink.redis.cache.windows.net"
    }

  # module.security.azurerm_private_dns_zone.redis will be created
  + resource "azurerm_private_dns_zone" "redis" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.redis.cache.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "microservice-app-rg"
    }

  # module.security.azurerm_private_dns_zone_virtual_network_link.redis will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "redis" {
      + id                    = (known after apply)
      + name                  = "redis-dns-link"
      + private_dns_zone_name = "privatelink.redis.cache.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "microservice-app-rg"
      + virtual_network_id    = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.Network/virtualNetworks/microservice-vnet"
    }

  # module.security.azurerm_private_endpoint.redis will be created
  + resource "azurerm_private_endpoint" "redis" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "centralus"
      + name                     = "redis-pe"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "microservice-app-rg"
      + subnet_id                = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.Network/virtualNetworks/microservice-vnet/subnets/cache-subnet"

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "redis-privatesc"
          + private_connection_resource_id = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.Cache/redis/microservice-redis"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

Plan: 8 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ frontend_ip              = "48.214.173.102" -> (known after apply)
  ~ frontend_url             = "http://microservice-frontend-3kugvams.centralus.azurecontainer.io" -> (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_container_group.auth must be replaced%0A-/+ resource "azurerm_container_group" "auth" {%0A      ~ exposed_port                = [%0A          - {%0A              - port     = 8000%0A              - protocol = "TCP"%0A            },%0A        ] -> (known after apply)%0A      + fqdn                        = (known after apply)%0A      ~ id                          = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.ContainerInstance/containerGroups/auth-service" -> (known after apply)%0A      ~ ip_address                  = "10.0.6.4" -> (known after apply)%0A        name                        = "auth-service"%0A      + network_profile_id          = (known after apply)%0A      - tags                        = {} -> null%0A      - zones                       = [] -> null%0A        # (8 unchanged attributes hidden)%0A%0A      ~ container {%0A          ~ commands                     = [] -> (known after apply)%0A          - cpu_limit                    = 0 -> null%0A          ~ image                        = "osgomez/auth-api:gh-38e787e5" -> "osgomez/auth-service:latest" # forces replacement%0A          - memory_limit                 = 0 -> null%0A            name                         = "auth-container"%0A          - secure_environment_variables = (sensitive value) -> null%0A            # (3 unchanged attributes hidden)%0A%0A            # (1 unchanged block hidden)%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # azurerm_container_group.frontend must be replaced%0A-/+ resource "azurerm_container_group" "frontend" {%0A      ~ exposed_port                = [%0A          - {%0A              - port     = 80%0A              - protocol = "TCP"%0A            },%0A        ] -> (known after apply)%0A      ~ fqdn                        = "microservice-frontend-3kugvams.centralus.azurecontainer.io" -> (known after apply)%0A      ~ id                          = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.ContainerInstance/containerGroups/frontend-service" -> (known after apply)%0A      ~ ip_address                  = "48.214.173.102" -> (known after apply)%0A        name                        = "frontend-service"%0A      + network_profile_id          = (known after apply)%0A      - subnet_ids                  = [] -> null%0A      - tags                        = {} -> null%0A      - zones                       = [] -> null%0A        # (8 unchanged attributes hidden)%0A%0A      ~ container {%0A          ~ commands                     = [] -> (known after apply)%0A          - cpu_limit                    = 0 -> null%0A          ~ environment_variables        = { # forces replacement%0A              - "AUTH_API_ADDRESS"  = "http://10.0.6.4:8000"%0A              - "TODOS_API_ADDRESS" = "http://10.0.8.4:8082"%0A            } -> (known after apply) # forces replacement%0A          ~ image                        = "osgomez/frontend:gh-38e787e5" -> "osgomez/frontend:latest" # forces replacement%0A          - memory_limit                 = 0 -> null%0A            name                         = "frontend-container"%0A          - secure_environment_variables = (sensitive value) -> null%0A            # (2 unchanged attributes hidden)%0A%0A            # (1 unchanged block hidden)%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # azurerm_container_group.todos must be replaced%0A-/+ resource "azurerm_container_group" "todos" {%0A      ~ exposed_port                = [%0A          - {%0A              - port     = 8082%0A              - protocol = "TCP"%0A            },%0A        ] -> (known after apply)%0A      + fqdn                        = (known after apply)%0A      ~ id                          = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.ContainerInstance/containerGroups/todos-service" -> (known after apply)%0A      ~ ip_address                  = "10.0.8.4" -> (known after apply)%0A        name                        = "todos-service"%0A      + network_profile_id          = (known after apply)%0A      - tags                        = {} -> null%0A      - zones                       = [] -> null%0A        # (8 unchanged attributes hidden)%0A%0A      ~ container {%0A          ~ commands                     = [] -> (known after apply)%0A          - cpu_limit                    = 0 -> null%0A          ~ image                        = "osgomez/todos-api:gh-38e787e5" -> "osgomez/todos-service:latest" # forces replacement%0A          - memory_limit                 = 0 -> null%0A            name                         = "todos-container"%0A          - secure_environment_variables = (sensitive value) -> null%0A            # (3 unchanged attributes hidden)%0A%0A            # (1 unchanged block hidden)%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # azurerm_container_group.users must be replaced%0A-/+ resource "azurerm_container_group" "users" {%0A      ~ exposed_port                = [%0A          - {%0A              - port     = 8083%0A              - protocol = "TCP"%0A            },%0A        ] -> (known after apply)%0A      + fqdn                        = (known after apply)%0A      ~ id                          = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.ContainerInstance/containerGroups/users-service" -> (known after apply)%0A      ~ ip_address                  = "10.0.7.4" -> (known after apply)%0A        name                        = "users-service"%0A      + network_profile_id          = (known after apply)%0A      - tags                        = {} -> null%0A      - zones                       = [] -> null%0A        # (8 unchanged attributes hidden)%0A%0A      ~ container {%0A          ~ commands                     = [] -> (known after apply)%0A          - cpu_limit                    = 0 -> null%0A          ~ image                        = "osgomez/users-api:gh-38e787e5" -> "osgomez/users-service:latest" # forces replacement%0A          - memory_limit                 = 0 -> null%0A            name                         = "users-container"%0A          - secure_environment_variables = (sensitive value) -> null%0A            # (3 unchanged attributes hidden)%0A%0A            # (1 unchanged block hidden)%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.security.azurerm_private_dns_a_record.redis will be created%0A  + resource "azurerm_private_dns_a_record" "redis" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "microservice-redis"%0A      + records             = (known after apply)%0A      + resource_group_name = "microservice-app-rg"%0A      + ttl                 = 300%0A      + zone_name           = "privatelink.redis.cache.windows.net"%0A    }%0A%0A  # module.security.azurerm_private_dns_zone.redis will be created%0A  + resource "azurerm_private_dns_zone" "redis" {%0A      + id                                                    = (known after apply)%0A      + max_number_of_record_sets                             = (known after apply)%0A      + max_number_of_virtual_network_links                   = (known after apply)%0A      + max_number_of_virtual_network_links_with_registration = (known after apply)%0A      + name                                                  = "privatelink.redis.cache.windows.net"%0A      + number_of_record_sets                                 = (known after apply)%0A      + resource_group_name                                   = "microservice-app-rg"%0A    }%0A%0A  # module.security.azurerm_private_dns_zone_virtual_network_link.redis will be created%0A  + resource "azurerm_private_dns_zone_virtual_network_link" "redis" {%0A      + id                    = (known after apply)%0A      + name                  = "redis-dns-link"%0A      + private_dns_zone_name = "privatelink.redis.cache.windows.net"%0A      + registration_enabled  = false%0A      + resource_group_name   = "microservice-app-rg"%0A      + virtual_network_id    = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.Network/virtualNetworks/microservice-vnet"%0A    }%0A%0A  # module.security.azurerm_private_endpoint.redis will be created%0A  + resource "azurerm_private_endpoint" "redis" {%0A      + custom_dns_configs       = (known after apply)%0A      + id                       = (known after apply)%0A      + location                 = "centralus"%0A      + name                     = "redis-pe"%0A      + network_interface        = (known after apply)%0A      + private_dns_zone_configs = (known after apply)%0A      + resource_group_name      = "microservice-app-rg"%0A      + subnet_id                = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.Network/virtualNetworks/microservice-vnet/subnets/cache-subnet"%0A%0A      + private_service_connection {%0A          + is_manual_connection           = false%0A          + name                           = "redis-privatesc"%0A          + private_connection_resource_id = "/subscriptions/eba0e2cc-47c4-4522-9928-a3f676b3e9e2/resourceGroups/microservice-app-rg/providers/Microsoft.Cache/redis/microservice-redis"%0A          + private_ip_address             = (known after apply)%0A          + subresource_names              = [%0A              + "redisCache",%0A            ]%0A        }%0A    }%0A%0APlan: 8 to add, 0 to change, 4 to destroy.%0A%0AChanges to Outputs:%0A  ~ frontend_ip              = "48.214.173.102" -> (known after apply)%0A  ~ frontend_url             = "http://mic
... (truncated for readability)
```

> **Security Note**: All changes have been scanned for security vulnerabilities using Checkov and Trivy.